#include"Head.h"

//// 字符串输出
//int main()
//{
//	char str[13]= { 73,32,99,97,110,32,100,111,32,105,116,33,0 };
//	printf("%s", str);
//	return 0;
//}
 //当数组是整形数组时，需要对每个一ASCII码进行转换
//int main()
//{
//	int arr[13] = { 73,32,99,97,110,32,100,111,32,105,116,33};
//	char str[13] = { 0 };
//	int i = 0;
//	for (i = 0; i < 12; i++)
//	{
//		str[i] = arr[i];
//	}
//	printf("%s", str);
//	//printf("%s", arr);// %s 必须存字符串地址，虽然%c能按照字符输出int变量对应的字符
//	return 0;
//}



//// 单个字符输出
//int main()
//{
//    int i = 0;
//    char arr[12] = { 73,32,99,97,110,32,100,111,32,105,116,33 };
//    for (i = 0; i < 12; i++)
//        printf("%c", arr[i]);//还可以用字符串输出，不过记得加\0
//    return 0;
//}

