#include"Head.h"
/*  *****************************    */
// while(i/=10) {  i % 10 ;  } 是基本思想，但是也要灵活变通


//// 包含数字9的数
//int main()
//{
//    int i = 0;
//    int count = 0;
//    for (i = 1; i <= 2019; i++)
//    {
//        int num = i;// 新建一个变量存 i
//        do// 先比较再进行舍弃
//        {
//            if (num % 10 == 9)
//            {
//                count++;
//                break;
//            }
//        } while (num /= 10);// while (i /= 10);----不能在循环内部改变循环变量
//    }
//    printf("%d", count);
//    return 0;
//}
// 如果投机取巧大可以用数的---这个方法还蛮考验思维灵活的哈

